<?php 
	// 逻辑与
	$a1 = 10;
	$a2 = 20;
	$a3 = $a1 && $a2;
	echo $a3;  // 1
	echo "<hr>";

	// 短路现象
	$a3 = 0 && ++$a2;
	echo $a3,$a2; // 0 20
	echo "<hr>";

	// 逻辑或
	$b1 = 10;
	$b2 = 20;
	// $b3 = $b1 || $b2;
	// echo $b3;    // 1
	// echo "<hr>";

	// 短路现象
	// $b3 = $b1++ || ++$b2;
	// echo $b3,$b2; // 1 20
	// echo "<hr>";

	// 组合
	// $b3 = $b1++ - 10 && ++$b2 || 0;
	// $b3 = ++$b1 - 11 || ++$b2 || $b1 && $b1 % 2;
	// echo $b3." ",$b1." ",$b2." "; 

	// 逻辑! 
	$d1 = 0;
	// echo !$d1; // 1


	// 逻辑异或  相异为真,相同为假
	$e1 = 0;
	$e2 = 20;
	$e3 = ($e1 xor $e2);
	echo $e3,"结果";
	// 异或的优先级比=号的优先级低

	// 不等于  不等为真 相等为假
	$f1 = 10;
	$f2 = 20;
	$f3 = $f1 <> $f2;
	// echo $f3;

	// 三目运算符
	$f3 = $f1 > $f2 ? "yes" : "no";
	$f3 = $f1 || $f2 ? $f1 : $f2;
	echo $f3;
 ?>